Котельников_АБ_70153995/src/Documents/ЗаявкаНаПодбор/ЗаявкаНаПодбор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПодбор</name>
  <basedOn>Catalog.ПрофилиДолжностей</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияЗаявокНаПодбор</registerRecords>
  <attributes>
    <name>ПланируемыйСрокЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЗаявку</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаПодбор</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторЗаявки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытияВакансии</name>
    <type>
      <types>EnumRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВакантнаяДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДолжности</name>
    <type>
      <types>EnumRef.КатегорииДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеловек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>EnumRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпытРаботы</name>
    <type>
      <types>EnumRef.ОпытРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностныеОбязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>EnumRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматРаботы</name>
    <type>
      <types>EnumRef.ФорматыРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоВычетаНалога</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКЗаявке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеНавыки</name>
    <attributes>
      <name>Навык</name>
      <type>
        <types>CatalogRef.КлючевыеНавыки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниПрофессиональныхНавыков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛичныеКачества</name>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.ЛичныеКачества</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗнанияЯзыков</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>CatalogRef.Языки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниЗнанийЯзыков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/Documents/ЗаявкаНаПодбор/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗаявкаНаПодбор.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаПодбор.ВакантнаяДолжность КАК ВакантнаяДолжность,
	|	ЗаявкаНаПодбор.ГрафикРаботы КАК ГрафикРаботы,
	|	ЗаявкаНаПодбор.ОплатаТрудаДо КАК ЗаработнаяПлатаДо,
	|	ЗаявкаНаПодбор.ОплатаТрудаОт КАК ЗаработнаяПлатаОт,
	|	ЗаявкаНаПодбор.ИнициаторЗаявки КАК ИнициаторЗаявки,
	|	ЗаявкаНаПодбор.КоличествоЧеловек КАК КоличествоНеобходимыхЧеловек,
	|	ЗаявкаНаПодбор.Номер КАК Номер,
	|	ЗаявкаНаПодбор.Образование КАК Образование,
	|	ЗаявкаНаПодбор.ОпытРаботы КАК ОпытРаботы,
	|	ЗаявкаНаПодбор.ПланируемыйСрокЗакрытия КАК ПланируемыйСрокЗакрытия,
	|	ЗаявкаНаПодбор.Подразделение КАК Подразделение,
	|	ЗаявкаНаПодбор.ПричинаОткрытияВакансии КАК ПричинаОткрытияВакансии,
	|	ЗаявкаНаПодбор.ТипЗанятости КАК ТипЗанятости,
	|	ЗаявкаНаПодбор.КлючевыеНавыки.(
	|		НомерСтроки КАК НомерСтроки,
	|		Навык КАК Навык,
	|		УровеньВладения КАК УровеньВладения
	|	) КАК КлючевыеНавыки,
	|	ЗаявкаНаПодбор.ЗнанияЯзыков.(
	|		НомерСтроки КАК НомерСтроки,
	|		Язык КАК Язык,
	|		УровеньВладения КАК УровеньВладения
	|	) КАК ИностранныеЯзыки,
	|	ЗаявкаНаПодбор.КатегорияДолжности КАК КатегорияДолжности,
	|	ЗаявкаНаПодбор.ФорматРаботы КАК ФорматРаботы
	|ИЗ
	|	Документ.ЗаявкаНаПодбор КАК ЗаявкаНаПодбор
	|ГДЕ
	|	ЗаявкаНаПодбор.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПрофессиональныеНавыкиШапка = Макет.ПолучитьОбласть("ПрофессиональныеНавыкиШапка");
	ОбластьПрофессиональныеНавыки = Макет.ПолучитьОбласть("КлючевыеНавыки");
	ОбластьИностранныеЯзыкиШапка = Макет.ПолучитьОбласть("ИностранныеЯзыкиШапка");
	ОбластьИностранныеЯзыки = Макет.ПолучитьОбласть("ИностранныеЯзыки");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
       	ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ТабДок.Вывести(ОбластьЗаголовок);
		Шапка.Параметры.Заполнить(Выборка);
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПрофессиональныеНавыкиШапка);
		ВыборкаПрофессиональныеНавыки = Выборка.ПрофессиональныеНавыки.Выбрать();
		Пока ВыборкаПрофессиональныеНавыки.Следующий() Цикл
			ОбластьПрофессиональныеНавыки.Параметры.Заполнить(ВыборкаПрофессиональныеНавыки);
			ТабДок.Вывести(ОбластьПрофессиональныеНавыки, ВыборкаПрофессиональныеНавыки.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьИностранныеЯзыкиШапка);
		ВыборкаИностранныеЯзыки = Выборка.ИностранныеЯзыки.Выбрать();
		Пока ВыборкаИностранныеЯзыки.Следующий() Цикл
			ОбластьИностранныеЯзыки.Параметры.Заполнить(ВыборкаИностранныеЯзыки);
			ТабДок.Вывести(ОбластьИностранныеЯзыки, ВыборкаИностранныеЯзыки.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
	Подвал.Параметры.ДолжностьИнициатора = Выборка.ИнициаторЗаявки.Должность.Наименование;
	Подвал.Параметры.ФИОИнициатора = Выборка.ИнициаторЗаявки.Наименование;		
	Подвал.Параметры.ТелефонИнициатора = Выборка.ИнициаторЗаявки.РабочийТелефон;		
	Подвал.Параметры.ПочтаИнициатора = Выборка.ИнициаторЗаявки.Эмаил;		


	ТабДок.Вывести(Подвал);
	
	//}}
КонецПроцедуры
